fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_СведенияОбОтпусках</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяПродолжительностьОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников
&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	ОтпускаСотрудниковПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура Заполнить(Команда)
	
	Если Объект.ОтпускаСотрудников.Количество() > 0 Тогда
		Результат = Ждать ВопросАсинх("Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет,,,"Вопрос");
		Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Объект.ОтпускаСотрудников.Очистить();
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Адрес", ПоместитьДанныеВоВременноеХранилище());
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.Форма", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВКМ_Сотрудники КАК ВКМ_Сотрудники
	|ГДЕ
	|	НЕ ВКМ_Сотрудники.ПометкаУдаления";
	
	СписокСотрудников = Запрос.Выполнить().Выгрузить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СписокСотрудников, Объект.ОтпускаСотрудников);
	
КонецПроцедуры


&НаСервере
Процедура ОтпускаСотрудниковПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СписокОтпусков.Сотрудник КАК Сотрудник,
	|	СписокОтпусков.НомерСтроки КАК НомерСтроки,
	|	РАЗНОСТЬДАТ(СписокОтпусков.ДатаНачала, СписокОтпусков.ДатаОкончания, ДЕНЬ) + 1 КАК ОбщаяПродолжительностьОтпуска
	|ПОМЕСТИТЬ ВТ_СписоОтпусков
	|ИЗ
	|	&СписокОтпусков КАК СписокОтпусков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СписоОтпусков.Сотрудник КАК Сотрудник,
	|	СУММА(ВТ_СписоОтпусков.ОбщаяПродолжительностьОтпуска) КАК ОбщаяПродолжительностьОтпуска
	|ПОМЕСТИТЬ ВТ_СписокСгруппированный
	|ИЗ
	|	ВТ_СписоОтпусков КАК ВТ_СписоОтпусков
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СписоОтпусков.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СписоОтпусков.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВТ_СписокСгруппированный.ОбщаяПродолжительностьОтпуска, 0) КАК ОбщаяПродолжительностьОтпуска
	|ИЗ
	|	ВТ_СписоОтпусков КАК ВТ_СписоОтпусков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СписокСгруппированный КАК ВТ_СписокСгруппированный
	|		ПО ВТ_СписоОтпусков.Сотрудник = ВТ_СписокСгруппированный.Сотрудник";
	
	СписокОтпусков = Объект.ОтпускаСотрудников.Выгрузить(, "НомерСтроки, Сотрудник, ДатаНачала, ДатаОкончания");
	Запрос.УстановитьПараметр("СписокОтпусков", СписокОтпусков);
	
	ТаблицаОтпусков = Запрос.Выполнить().Выбрать();
	
	Пока ТаблицаОтпусков.Следующий() Цикл
		Объект.ОтпускаСотрудников[ТаблицаОтпусков.НомерСтроки - 1].ОбщаяПродолжительностьОтпуска = ТаблицаОтпусков.ОбщаяПродолжительностьОтпуска;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере                                       
Функция ПоместитьДанныеВоВременноеХранилище() 
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(), УникальныйИдентификатор);  
	
КонецФункции

&НаСервере
Процедура НастроитьУсловноеОформление()
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	// общая продолжительность отпуска больше 28 дней
	Отбор = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.ОбщаяПродолжительностьОтпуска");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	Отбор.ПравоеЗначение = 28;
	
	// светло-розовый фон
	Оформление = ЭлементУсловногоОформления.Оформление;
	Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоРозовый);
	
	// вся строка табличной части
	ПолеОформления = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников");

	
КонецПроцедуры

#КонецОбласти
